import { KataOptions } from '@/models/articleModels'

export const articleSet1Option: KataOptions = {
  value: 'articleSet1',
  label: '必背名篇4-1',
  id: 6,
  children: [
    {
      id: 13,
      value: '丞相祠堂何处寻，锦官城外柏森森。映阶碧草自春色，隔叶黄鹂空好音。三顾频烦天下计，两朝开济老臣心。出师未捷身先死，长使英雄泪满襟。',
      label: '01 蜀相',
      isRemote: 0,
      children: []
    },
    {
      id: 14,
      value: '浩荡离愁白日斜，吟鞭东指即天涯。落红不是无情物，化作春泥更护花。',
      label: '02 己亥杂诗（其五）',
      isRemote: 0,
      children: []
    },
    {
      id: 15,
      value: '杨花落尽子规啼，闻道龙标过五溪。我寄愁心与明月，随君直到夜郎西。',
      label: '03 闻王昌龄左迁龙标遥有此寄',
      isRemote: 0,
      children: []
    },
    {
      id: 16,
      value: '烟笼寒水月笼沙，夜泊秦淮近酒家。商女不知亡国恨，隔江犹唱后庭花。',
      label: '04 泊秦淮',
      isRemote: 0,
      children: []
    },
    {
      id: 17,
      value: '单车欲问边，属国过居延。征蓬出汉塞，归雁入胡天。大漠孤烟直，长河落日圆。萧关逢候骑，都护在燕然。',
      label: '05 使至塞上',
      isRemote: 0,
      children: []
    },
    {
      id: 18,
      value: '剑外忽传收蓟北，初闻涕泪满衣裳。却看妻子愁何在，漫卷诗书喜欲狂。白日放歌须纵酒，青春作伴好还乡。即从巴峡穿巫峡，便下襄阳向洛阳。',
      label: '06 闻官军收河南河北',
      isRemote: 0,
      children: []
    },
    {
      id: 19,
      value: '东临碣石，以观沧海。水何澹澹，山岛竦峙。树木丛生，百草丰茂。秋风萧瑟，洪波涌起。日月之行，若出其中；星汉灿烂，若出其里。幸甚至哉，歌以咏志。',
      label: '07 观沧海',
      isRemote: 0,
      children: []
    },
    {
      id: 20,
      value: '老夫聊发少年狂，左牵黄，右擎苍，锦帽貂裘，千骑卷平冈。为报倾城随太守，亲射虎，看孙郎。酒酣胸胆尚开张，鬓微霜，又何妨！持节云中，何日遣冯唐？会挽雕弓如满月，西北望，射天狼。',
      label: '08 江城子·密州出猎',
      isRemote: 0,
      children: []
    },
    {
      id: 21,
      value: '客路青山外，行舟绿水前。潮平两岸阔，风正一帆悬。海日生残夜，江春入旧年。乡书何处达？归雁洛阳边。',
      label: '09 次北固山下',
      isRemote: 0,
      children: []
    },
    {
      id: 22,
      value: '一声梧叶一声秋，一点芭蕉一点愁，三更归梦三更后。落灯花棋未收，叹新丰孤馆人留。枕上十年事，江南二老忧，都到心头。',
      label: '10 水仙子·夜雨',
      isRemote: 0,
      children: []
    },
    {
      id: 23,
      value: '枯藤老树昏鸦，小桥流水人家，古道西风瘦马。夕阳西下，断肠人在天涯。',
      label: '11 天净沙·秋思',
      isRemote: 0,
      children: []
    },
    {
      id: 24,
      value: '君问归期未有期，巴山夜雨涨秋池。何当共剪西窗烛，却话巴山夜雨时。',
      label: '12 夜雨寄北',
      isRemote: 0,
      children: []
    },
    {
      id: 25,
      value: '结庐在人境，而无车马喧。问君何能尔？心远地自偏。采菊东篱下，悠然见南山。山气日夕佳，飞鸟相与还。此中有真意，欲辨已忘言。',
      label: '13 饮酒（其五）',
      isRemote: 0,
      children: []
    },
    {
      id: 26,
      value: '昨夜雨疏风骤，浓睡不消残酒。试问卷帘人，却道海棠依旧。知否，知否？应是绿肥红瘦。',
      label: '14 如梦令·昨夜雨疏风骤',
      isRemote: 0,
      children: []
    },
    {
      id: 27,
      value: '元丰六年十月十二日夜，解衣欲睡，月色入户，欣然起行。念无与为乐者，遂至承天寺寻张怀民。怀民亦未寝，相与步于中庭。庭下如积水空明，水中藻、荇交横，盖竹柏影也。何夜无月？何处无竹柏？但少闲人如吾两人者耳。',
      label: '15 记承天寺夜游',
      isRemote: 0,
      children: []
    },
    {
      id: 28,
      value: '丙辰中秋，欢饮达旦，大醉，作此篇，兼怀子由。明月几时有？把酒问青天。不知天上宫阙，今夕是何年。我欲乘风归去，又恐琼楼玉宇，高处不胜寒。起舞弄清影，何似在人间。转朱阁，低绮户，照无眠。不应有恨，何事长向别时圆？人有悲欢离合，月有阴晴圆缺，此事古难全。但愿人长久，千里共婵娟。',
      label: '16 水调歌头·明月几时有',
      isRemote: 0,
      children: []
    },
    {
      id: 29,
      value: '城阙辅三秦，风烟望五津。与君离别意，同是宦游人。海内存知己，天涯若比邻。无为在歧路，儿女共沾巾。',
      label: '17 送杜少府之任蜀州',
      isRemote: 0,
      children: []
    },
    {
      id: 30,
      value: '金樽清酒斗十千，玉盘珍羞直万钱。停杯投箸不能食，拔剑四顾心茫然。欲渡黄河冰塞川，将登太行雪满山。闲来垂钓碧溪上，忽复乘舟梦日边。行路难，行路难，多歧路，今安在？长风破浪会有时，直挂云帆济沧海。',
      label: '18 行路难·其一',
      isRemote: 0,
      children: []
    },
    {
      id: 31,
      value: '辛苦遭逢起一经，干戈寥落四周星。山河破碎风飘絮，身世浮沉雨打萍。惶恐滩头说惶恐，零丁洋里叹零丁。人生自古谁无死？留取丹心照汗青。',
      label: '19 过零丁洋',
      isRemote: 0,
      children: []
    },
    {
      id: 32,
      value: '独立寒秋，湘江北去，橘子洲头。看万山红遍，层林尽染；漫江碧透，百舸争流。鹰击长空，鱼翔浅底，万类霜天竞自由。怅寥廓，问苍茫大地，谁主沉浮？携来百侣曾游，忆往昔峥嵘岁月稠。恰同学少年，风华正茂；书生意气，挥斥方遒。指点江山，激扬文字，粪土当年万户侯。曾记否，到中流击水，浪遏飞舟？',
      label: '20 沁园春·长沙',
      isRemote: 0,
      children: []
    },
    {
      id: 33,
      value: '病起萧萧两鬓华。卧看残月上窗纱。豆蔻连梢煎熟水，莫分茶。枕上诗书闲处好，门前风景雨来佳。终日向人多酝藉，木犀花。',
      label: '21 摊破浣溪沙·病起萧萧两鬓华',
      isRemote: 0,
      children: []
    },
    {
      id: 34,
      value: '春花秋月何时了？往事知多少。小楼昨夜又东风，故国不堪回首月明中。雕栏玉砌应犹在，只是朱颜改。问君能有几多愁？恰似一江春水向东流。',
      label: '22 虞美人·春花秋月何时了',
      isRemote: 0,
      children: []
    },
    {
      id: 35,
      value: '舜发于畎亩之中，傅说举于版筑之间，胶鬲举于鱼盐之中，管夷吾举于士，孙叔敖举于海，百里奚举于市。故天将降大任于是人也，必先苦其心志，劳其筋骨，饿其体肤，空乏其身，行拂乱其所为，所以动心忍性，曾益其所不能。人恒过，然后能改；困于心，衡于虑，而后作；征于色，发于声，而后喻。入则无法家拂士，出则无敌国外患者，国恒亡，然后知生于忧患而死于安乐也。',
      label: '23 生于忧患，死于安乐',
      isRemote: 0,
      children: []
    },
    {
      id: 36,
      value: '天接云涛连晓雾，星河欲转千帆舞。仿佛梦魂归帝所，闻天语，殷勤问我归何处。我报路长嗟日暮，学诗谩有惊人句。九万里风鹏正举。风休住，蓬舟吹取三山去！',
      label: '24 渔家傲·天接云涛连晓雾',
      isRemote: 0,
      children: []
    },
    {
      id: 37,
      value: '邹忌修八尺有余，而形貌昳丽。朝服衣冠，窥镜，谓其妻曰：“我孰与城北徐公美？”其妻曰：“君美甚，徐公何能及君也？”城北徐公，齐国之美丽者也。忌不自信，而复问其妾曰：“吾孰与徐公美？”妾曰：“徐公何能及君也？”旦日，客从外来，与坐谈，问之客曰：“吾与徐公孰美？”客曰：“徐公不若君之美也。”明日徐公来，孰视之，自以为不如；窥镜而自视，又弗如远甚。暮寝而思之，曰：“吾妻之美我者，私我也；妾之美我者，畏我也；客之美我者，欲有求于我也。”于是入朝见威王，曰：“臣诚知不如徐公美。臣之妻私臣，臣之妾畏臣，臣之客欲有求于臣，皆以美于徐公。今齐地方千里，百二十城，宫妇左右莫不私王，朝廷之臣莫不畏王，四境之内莫不有求于王：由此观之，王之蔽甚矣。”王曰：“善。”乃下令：“群臣吏民能面刺寡人之过者，受上赏；上书谏寡人者，受中赏；能谤讥于市朝，闻寡人之耳者，受下赏。”令初下，群臣进谏，门庭若市；数月之后，时时而间进；期年之后，虽欲言，无可进者。燕、赵、韩、魏闻之，皆朝于齐。此所谓战胜于朝廷。',
      label: '25 邹忌讽齐王纳谏',
      isRemote: 0,
      children: []
    }
  ]
}
